[
    {
        "description": [
            "The Great Pyramid of Giza is the largest Egyptian pyramid and served as the tomb of pharaoh Khufu, who ruled during the Fourth Dynasty of the Old Kingdom. Built c. 2600 BC, over a period of about 27 years, the pyramid is the oldest of the Seven Wonders of the Ancient World, and the only wonder that has remained largely intact. It is the most famous monument of the Giza pyramid complex, which is part of the UNESCO World Heritage Site \"Memphis and its Necropolis\". It is situated at the northeastern end of the line of the three main pyramids at Giza.",
            "Initially standing at 146.6 metres (481 feet), the Great Pyramid was the world's tallest human-made structure for more than 3,800 years. Over time, most of the smooth white limestone casing was removed, which lowered the pyramid's height to the current 138.5 metres (454.4 ft); what is seen today is the underlying core structure. The base was measured to be about 230.3 metres (755.6 ft) square, giving a volume of roughly 2.6 million cubic metres (92 million cubic feet), which includes an internal hillock. The dimensions of the pyramid were 280 royal cubits (146.7 m; 481.4 ft) high, a base length of 440 cubits (230.6 m; 756.4 ft), with a seked of 5 1/2 palms (a slope of 51°50'40\").",
            "The Great Pyramid was built by quarrying an estimated 2.3 million large blocks, weighing 6 million tonnes in total. The majority of the stones are not uniform in size or shape, and are only roughly dressed. The outside layers were bound together by mortar. Primarily local limestone from the Giza Plateau was used for its construction. Other blocks were imported by boat on the Nile: white limestone from Tura for the casing, and blocks of granite from Aswan, weighing up to 80 tonnes, for the \"King's Chamber\" structure.",
            "There are three known chambers inside of the Great Pyramid. The lowest was cut into the bedrock, upon which the pyramid was built, but remained unfinished. The so-called Queen's Chamber and King's Chamber, which contain a granite sarcophagus, are above ground, within the pyramid structure. Hemiunu, Khufu's vizier, is believed by some to be the architect of the Great Pyramid. Many varying scientific and alternative hypotheses attempt to explain the exact construction techniques, but, as is the case for other such structures, there is no definite consensus.",
            "The funerary complex around the pyramid consisted of two mortuary temples connected by a causeway (one close to the pyramid and one near the Nile); tombs for the immediate family and court of Khufu, including three smaller pyramids for Khufu's wives; an even smaller \"satellite pyramid\"; and five buried solar barges."
        ],
        "name": "Great Pyramid of Giza",
        "source": "https://en.wikipedia.org/wiki/Great_Pyramid_of_Giza"
    },
    {
        "description": [
            "The Colossus of Rhodes (Ancient Greek: ὁ Κολοσσὸς Ῥόδιος, romanized: ho Kolossòs Rhódios; Greek: Κολοσσός της Ρόδου, romanized: Kolossós tes Rhódou) was a statue of the Greek sun god Helios, erected in the city of Rhodes, on the Greek island of the same name, by Chares of Lindos in 280 BC. One of the Seven Wonders of the Ancient World, it was constructed to celebrate the successful defence of Rhodes city against an attack by Demetrius I of Macedon, who had besieged it for a year with a large army and navy.",
            "According to most contemporary descriptions, the Colossus stood approximately 70 cubits, or 33 metres (108 feet) high – approximately the height of the modern Statue of Liberty from feet to crown – making it the tallest statue in the ancient world. It collapsed during the earthquake of 226 BC, although parts of it were preserved. In accordance with the Oracle of Delphi, the Rhodians did not rebuild it. John Malalas wrote that Hadrian in his reign re-erected the Colossus, but he was mistaken. According to the Suda, the Rhodians were called Colossaeans (Κολοσσαεῖς), because they erected the statue on the island.",
            "In 653, an Arab force under Muslim general Mu'awiya I conquered Rhodes, and according to the Chronicle of Theophanes the Confessor, the statue was completely destroyed and the remains sold; this account may be unreliable.",
            "Since 2008, a series of as-yet-unrealized proposals to build a new Colossus at Rhodes Harbour have been announced, although the actual location of the original monument remains in dispute."
        ],
        "name": "Colossus of Rhodes",
        "source": "https://en.wikipedia.org/wiki/Colossus_of_Rhodes"
    },
    {
        "description": [
            "The Hanging Gardens of Babylon were one of the Seven Wonders of the Ancient World listed by Hellenic culture. They were described as a remarkable feat of engineering with an ascending series of tiered gardens containing a wide variety of trees, shrubs, and vines, resembling a large green mountain constructed of mud bricks. It was said to have been built in the ancient city of Babylon, near present-day Hillah, Babil province, in Iraq. The Hanging Gardens' name is derived from the Greek word κρεμαστός (kremastós, lit. 'overhanging'), which has a broader meaning than the modern English word \"hanging\" and refers to trees being planted on a raised structure such as a terrace.",
            "According to one legend, the Hanging Gardens were built alongside a grand palace known as The Marvel of Mankind, by the Neo-Babylonian King Nebuchadnezzar II (who ruled between 605 and 562 BC), for his Median wife, Queen Amytis, because she missed the green hills and valleys of her homeland. This was attested to by the Babylonian priest Berossus, writing in about 290 BC, a description that was later quoted by Josephus. The construction of the Hanging Gardens has also been attributed to the legendary queen Semiramis and they have been called the Hanging Gardens of Semiramis as an alternative name.",
            "The Hanging Gardens are the only one of the Seven Wonders for which the location has not been definitively established. There are no extant Babylonian texts that mention the gardens, and no definitive archaeological evidence has been found in Babylon. Three theories have been suggested to account for this: first, that they were purely mythical, and the descriptions found in ancient Greek and Roman writings (including those of Strabo, Diodorus Siculus and Quintus Curtius Rufus) represented a romantic ideal of an eastern garden; second, that they existed in Babylon, but were destroyed sometime around the first century AD; and third, that the legend refers to a well-documented garden that the Assyrian King Sennacherib (704–681 BC) built in his capital city of Nineveh on the River Tigris, near the modern city of Mosul."
        ],
        "name": "Hanging Gardens of Babylon",
        "source": "https://en.wikipedia.org/wiki/Hanging_Gardens_of_Babylon"
    },
    {
        "description": [
            "The Lighthouse of Alexandria, sometimes called the Pharos of Alexandria (/ˈfɛərɒs/ FAIR-oss; Ancient Greek: ὁ Φάρος τῆς Ἀλεξανδρείας, romanized: ho Pháros tês Alexandreías, contemporary Koine Greek pronunciation: [ho pʰáros tɛ̂ːs aleksandrěːaːs]; Arabic: فنار الإسكندرية), was a lighthouse built by the Ptolemaic Kingdom of Ancient Egypt, during the reign of Ptolemy II Philadelphus (280–247 BC). It has been estimated to have been at least 100 metres (330 ft) in overall height. One of the Seven Wonders of the Ancient World, for many centuries it was one of the tallest man-made structures in the world.",
            "The lighthouse was severely damaged by three earthquakes between 956 and 1323 AD and became an abandoned ruin. It was the third-longest surviving ancient wonder, after the Mausoleum at Halicarnassus and the extant Great Pyramid of Giza, surviving in part until 1480, when the last of its remnant stones were used to build the Citadel of Qaitbay on the site.",
            "In 1994, a team of French archaeologists dove into the water of Alexandria's Eastern Harbor and discovered some remains of the lighthouse on the sea floor. In 2016 the Ministry of State of Antiquities in Egypt had plans to turn submerged ruins of ancient Alexandria, including those of the Pharos, into an underwater museum."
        ],
        "name": "Lighthouse of Alexandria",
        "source": "https://en.wikipedia.org/wiki/Lighthouse_of_Alexandria"
    },
    {
        "name": "Mausoleum at Halicarnassus",
        "description": [
            "The Mausoleum at Halicarnassus or Tomb of Mausolus[a] (Ancient Greek: Μαυσωλεῖον τῆς Ἁλικαρνασσοῦ; Turkish: Halikarnas Mozolesi) was a tomb built between 353 and 350 BC in Halicarnassus (present Bodrum, Turkey) for Mausolus, an Anatolian from Caria and a satrap in the Achaemenid Empire, and his sister-wife Artemisia II of Caria. The structure was designed by the Greek architects Satyros and Pythius of Priene. Its elevated tomb structure is derived from the tombs of neighbouring Lycia, a territory Mausolus had invaded and annexed c. 360 BC, such as the Nereid Monument.",
            "The Mausoleum was approximately 45 m (148 ft) in height, and the four sides were adorned with sculptural reliefs, each created by one of four Greek sculptors: Leochares, Bryaxis, Scopas of Paros, and Timotheus. The Mausoleum contained total 400 freestanding sculptures. The mausoleum was considered to be such an aesthetic triumph that Antipater of Sidon identified it as one of his Seven Wonders of the Ancient World. It was destroyed by successive earthquakes from the 12th to the 15th century; it was the last surviving of the six destroyed wonders.",
            "The word mausoleum has now come to be used generically for an above-ground tomb."
        ],
        "source": "https://en.wikipedia.org/wiki/Mausoleum_at_Halicarnassus"
    },
    {
        "description": [
            "The Statue of Zeus at Olympia was a giant seated figure, about 12.4 m (41 ft) tall, made by the Greek sculptor Phidias around 435 BC at the sanctuary of Olympia, Greece, and erected in the Temple of Zeus there. Zeus is the sky and thunder god in ancient Greek religion, who rules as king of the gods of Mount Olympus.",
            "The statue was a chryselephantine sculpture of ivory plates and gold panels on a wooden framework. Zeus sat on a painted cedarwood throne ornamented with ebony, ivory, gold, and precious stones. It was one of the Seven Wonders of the Ancient World.",
            "The statue was lost and destroyed before the end of the 6th century AD, with conflicting accounts of the date and circumstances. Details of its form are known only from ancient Greek descriptions and representations on coins and art."
        ],
        "name": "Statue of Zeus at Olympia",
        "source": "https://en.wikipedia.org/wiki/Statue_of_Zeus_at_Olympia"
    },
    {
        "description": [
            "The Temple of Artemis or Artemision (Greek: Ἀρτεμίσιον; Turkish: Artemis Tapınağı), also known as the Temple of Diana, was a Greek temple dedicated to an ancient, localised form of the goddess Artemis (equalized to Diana, a Roman goddess). It was located in Ephesus (near the modern town of Selçuk in present-day Turkey). By AD 401 it had been ruined or destroyed. Only foundations and fragments of the last temple remain at the site.",
            "The earliest version of the temple (a Bronze Age temenos) antedated the Ionic immigration by many years. Callimachus, in his Hymn to Artemis, attributed it to the Amazons. In the 7th century BC, it was destroyed by a flood.",
            "Its reconstruction, in more grandiose form, began around 550 BC, under Chersiphron, the Cretan architect, and his son Metagenes. The project was funded by Croesus of Lydia, and took 10 years to complete. This version of the temple was destroyed in 356 BC by an arsonist.",
            "The next, greatest, and last form of the temple, funded by the Ephesians themselves, is described in Antipater of Sidon's list of the world's Seven Wonders:",
            "\"I have set eyes on the wall of lofty Babylon on which is a road for chariots, and the statue of Zeus by the Alpheus, and the hanging gardens, and the colossus of the Sun, and the huge labour of the high pyramids, and the vast tomb of Mausolus; but when I saw the house of Artemis that mounted to the clouds, those other marvels lost their brilliancy, and I said, 'Lo, apart from Olympus, the Sun never looked on aught so grand'.\""
        ],
        "name": "Temple of Artemis",
        "source": "https://en.wikipedia.org/wiki/Temple_of_Artemis"
    }
]
